# Задано чотирицифрове натуральне число. 
# Знайти добуток цифр цього числа.
# Записати число в реверсному порядку.
# Посортувати цифри, що входять в дане число

num = input('Введіть чотиризначне натуральне число:')

int_num = list(num)
i = len(int_num)-1
sum = 1
while i > 0:
    sum *= int(int_num[i])
    i -= 1

print(sum) # Знайти добуток цифр цього числа.

# Записати число в реверсному порядку.
int_num.reverse() 
print(''.join(int_num))

# Посортувати цифри, що входять в дане число
int_num.sort() 
print(''.join(int_num))