#################################
 .append() .pop()
#################################
l = [1,2,3,4,5,6]
l.append(7)
print(l)
l.pop()
print(l)
l.pop(0)
print(l)
#################################
.items() .values() .keys()
#################################
k1 = {'1':11, '2':22, '3':33}
print('1' in k1.keys())
---------------------------------
k1 = {'1':11, '2':22, '3':33}
print(11 in k1.values())
---------------------------------
k1 = {'1':11, '2':22, '3':33}
for k,v in k1.items():
    print(k,':',v) 
---------------------------------
k1 = {'1':11, '2':22, '3':33}
print(list(k1.values()))
print(list(k1.keys()))
---------------------------------
k1 = {'1':11, '2':22, '3':33}
for k in k1:
    print(k1[k])
###################################################################
 ITERATORS:
#################################

#################################
 range() 
#################################
for k in range(0,10):
    print(k)
#################################
l = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5, 'g':6}
for k in l:
    print(k)
###################################################################
 iter() next()
#################################
l = [1,2,3,4,5,6]
a = iter(l)
print(next(a)) # 1
print(next(a)) # 2
---------------------------------
i = iter(range(0,10))
print(next(i)) # 0
print(next(i)) # 1
#################################
 enumerate()
---------------------------------
l = ['a','b','c']
i = enumerate(l)
print(next(i)) # (0, 'a')
print(next(i)) # (1, 'b')
###################################################################
FUNCTION
---------------------------------
def add(a, b): # именованые аргументы
    return a + b
print( add (10,20)) # 30
---------------------------------
def subtract(a, b): # именованые аргументы
    return a - b
print( subtract (b=10, a=100)) # 90 
---------------------------------
def multiply(a, b = 2): # именованые аргументы
    return a * b
print( multiply (10)) # 20
---------------------------------
def sum( *args ):  # неотпределённое количество аргументов
    s = 0
    for i in args:
        s += i
    return s
print( sum (1,2,3,4,5)) # 15
---------------------------------
def info( **kwargs ):  # словарь с аргументами        
    print( kwargs.get('name')) # 'David' 
info (name='David')
---------------------------------
def info(a, b, *args, **kwargs ):
    print(args)                # (40, 50)
    print( kwargs.get('name')) # 'David' 
    for k, v in kwargs.items():
        print( k, v )       # name Ivan
                            # age 25
info (10, 25, 40, 50, name='Ivan', age=25)
---------------------------------
передача аргументов в виде функций
---------------------------------
def pow2(n):
    return n ** 2 

def apply(n, func):
    return func(n)

print(apply(10, pow2)) # 100
---------------------------------
filter()
---------------------------------
l = [1,2,3,4,5,6,7,8]
def is_odd(n):
    if n % 2 == 0:
        return True
    else:
        return False
res = list(filter(is_odd, l))
print(res)  # [2, 4, 6, 8]
---------------------------------
map()
---------------------------------
l = [1,2,3,4,5,6,7,8]
def is_odd(n):
    if n % 2 == 0:
        return True
    else:
        return False
res = list(map(is_odd, l))
print(res)  # [False, True, False, True, False, True, False, True]
---------------------------------
l = [1,2,3,4,5,6,7,8]
def pow2(n):
    return n ** 2 
res = list(map(pow2, l))
print(res)  # [1, 4, 9, 16, 25, 36, 49, 64]
---------------------------------
l = [10,22,33,41,56,-6,70,8]
def max_in_list(n):
    max = n[0]
    for i in n:
        if i > max:
            max = i
    return max
print(max_in_list(l)) # 70
---------------------------------

 встроенные функции
---------------------------------